Jorge Castro DAPT NOV2021
# Lab 9

* Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:

In [148]:
from sqlalchemy import create_engine
import pandas as pd
import getpass
import numpy as np

In [149]:
password = getpass.getpass()
DATABASE_LOCATION = 'mysql+pymysql://root:' + password + '@localhost/sakila'

········

In [150]:
query_1 = """
SELECT concat((b.last_name), ' ', (b.first_name)) AS customer_name,
    count(*) AS number_of_films_rented_may
FROM rentals_may a
    INNER JOIN customer b ON a.customer_id = b.customer_id
GROUP BY 1
ORDER BY 1;
"""

In [151]:
query_2 = """
SELECT concat((b.last_name), ' ', (b.first_name)) AS customer_name,
    count(*) AS number_of_films_rented_june
FROM rentals_june a
    INNER JOIN customer b ON a.customer_id = b.customer_id
GROUP BY 1
ORDER BY 1;
"""

In [152]:
engine = create_engine(DATABASE_LOCATION, echo=True)
data_1 = pd.read_sql_query(query_1, engine)
data_1.head()

2022-01-08 21:39:56,957 INFO sqlalchemy.engine.Engine SHOW VARIABLES LIKE 'sql_mode'
2022-01-08 21:39:56,961 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-01-08 21:39:56,974 INFO sqlalchemy.engine.Engine SHOW VARIABLES LIKE 'lower_case_table_names'
2022-01-08 21:39:56,976 INFO sqlalchemy.engine.Engine [generated in 0.00206s] {}
2022-01-08 21:39:56,984 INFO sqlalchemy.engine.Engine SELECT DATABASE()
2022-01-08 21:39:56,986 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-01-08 21:39:56,990 INFO sqlalchemy.engine.Engine
SELECT
    concat((b.last_name), ' ', (b.first_name)) AS customer_name,
    count(*) AS number_of_films_rented_may
FROM
    rentals_may a
    INNER JOIN customer b ON a.customer_id = b.customer_id
GROUP BY
    1
ORDER BY
    1;


2022-01-08 21:39:56,992 INFO sqlalchemy.engine.Engine [raw sql] {}

    customer_name  number_of_films_rented_may
0    ABNEY RAFAEL                           2
1  ADAM NATHANIEL                           3
2  ADAMS KATHLEEN                           2
3   ALLARD GORDON                           1
4   ALLEN SHIRLEY                           1

In [153]:
data_2 = pd.read_sql_query(query_2, engine)
data_2.head()

2022-01-08 21:39:57,889 INFO sqlalchemy.engine.Engine
SELECT
    concat((b.last_name), ' ', (b.first_name)) AS customer_name,
    count(*) AS number_of_films_rented_june
FROM
    rentals_june a
    INNER JOIN customer b ON a.customer_id = b.customer_id
GROUP BY
    1
ORDER BY
    1;

2022-01-08 21:39:57,890 INFO sqlalchemy.engine.Engine [raw sql] {}

     customer_name  number_of_films_rented_june
0     ABNEY RAFAEL                            4
1   ADAM NATHANIEL                            2
2   ADAMS KATHLEEN                            1
3  ALEXANDER DIANA                            7
4    ALLARD GORDON                            3

In [154]:
data_merged = pd.merge(data_1, data_2)

In [155]:
data_merged.head()

    customer_name  number_of_films_rented_may  number_of_films_rented_june
0    ABNEY RAFAEL                           2                            4
1  ADAM NATHANIEL                           3                            2
2  ADAMS KATHLEEN                           2                            1
3   ALLARD GORDON                           1                            3
4   ALLEN SHIRLEY                           1                            8